let str1 = `벡틱 기호를 이용한 문자열`;

console.log(str1);

//---------------------

let a = "슬램덩크";
let b = "강백호";
let c = `농구 만화 "${a}"의 주인공은 "${b}"이다`

console.log(c);

//---------------------

const str2 = `금강산도 ${prompt("금강산도 이후에 이어지는 문장을 입력하세요")}`

console.log(str2)

/*

1.
백틱 
`
물결(~) 키를 쉬프트(shift) 없이 누르면 입력할 수 있다.
백틱 기호를 통해 문자열을 표시할 수 있다.

const str1 = '작은 따옴표'
const str2 = "큰 따옴표"
const str3 = `백틱`

2.
탬플릿 리터럴
- 백틱 기호를 이용해 문자열을 표시하고 문자열 사이에 표현식(변수, 데이터등, 메소드)을 
  삽입할 수 있는 문자열 표현법
- 플레이스홀더 ${}를 통해 문자열 내부에 표현식을 적을 수 있다

*/

