window.console.log("log()");
window.console.log("기록 메소드");
console.clear()

/*

1.
디버깅 콘솔을 이용하면 자바스크립트 코드를 테스트할 수 있다(웹브라우저 F12 -> console 메뉴)

2.
window 객체는 다양한 하위 객체, 메소드, 데이터 등을 포함하고 있다.
window는 생략가능하다.
cosole 객체는 window의 하위 객체이다.
colsole 객체는 브라우저의 디버깅 콘솔에 접근할 수 있게 해 준다.

3.
window.console.메소드()
콘솔에서 점을 한 번을 더 찍으면 console의 다른 기능을 사용 할 수 있다. 
log() - 로그의 괄호 안에 입력된 내용을 console 화면에 기록하는 기능(메소드).
clear() - console 화면에 기록된 내용을 지우는 기능(메소드).

4.
한줄에 여러 코드를 사용할 때는 각 코드의 마지막에 세미콜론을 사용해야 한다.
한줄에 코드 하나만 사용할 경우 세미콜론은 선택사항이다.
자바스크립트에 사용되는 코드는 대소문자를 구분한다.

*/


