window.alert("null")

/*

1.
객체 사용법
객체.데이터 - 객체가 가지고 있는 숫자, 문자 등의 다양한 데이터를 사용할 수 있다.
객체.기능() - 객체가 가지고 있는 다양한 기능을 수행 할 수 있다.
            - () 안에 숫자, 문자 등의 다양한 데이터를 입력할 수 있다.
            - 객체가 가진 기능을 '메소드'라고 한다.
.(점)의 의미 - .(점)은 객체 안에 있는 메소드를 사용하겠다 또는 접근하겠다는 의미.
              에를들어 window.alert()에서 window 객체 안에있는 alert 메소드를 사용
              하겠다 또는 접근하겠다는 의미.

window.alert()
window - 웹브라우저 객체
alert() - 웹브라우저에 경고창 표시 메소드
        - '', "" 따옴표나 쌍따옴표를 사용하여 문자를 입력할 수 있다.

2.
alert : (위험 등을) 알리다
      : 경계 경보
      : 기민한, 경계하는.

*/

